# SQL Challenges, Class Day 6

The following notebook includes 4 questions from the SQL challenges given in class as well as the table and normally distributed visualization for question 10. Details [here](https://docs.google.com/document/d/1BQJTwEZtaTSCl6a8pCJV4aFx2sbzJaJJ-5b62mnSlpY/edit).

In [ ]:
import pandas as pd

In [6]:
'''
Which top 3 categories of crime are most likely to go unresolved in Mission District?
'''
query_1 = pd.read_csv('datasets/sql_challenges-top_3_crime_cat-6475ffb44a32-2018-01-27-07-29-39.csv')
query_1

   resolution       category
0        7582  LARCENY/THEFT
1        2377   NON-CRIMINAL
2        1379        ASSAULT

In [4]:
'''
Write a query that find the top 5 tallest players, 
as well as their position, height, school, and the conference they belong to. 
'''

query_2 = pd.read_csv('datasets/sql_challenges-top_5_height-35b056af87ff-2018-01-27-06-59-09 (1).csv')
query_2

  full_school_name position  height conference
0     North Dakota       OL    80.0    Big Sky
1     North Dakota       OL    78.0    Big Sky
2     North Dakota       TE    78.0    Big Sky
3     North Dakota       DL    77.0    Big Sky
4     North Dakota       OL    77.0    Big Sky

In [5]:
'''
Create a table that displays the average height of players at each position.
'''

query_3= pd.read_csv('datasets/sql_challenges-avg_height-e59a1440aafb-2018-01-27-06-38-13.csv')
query_3

          avg position
0   72.322258       LB
1   70.583639       DB
2   70.862385        K
3   73.620588       QB
4   74.225914       DT
5   74.089286       NT
6   74.744102       DE
7   75.424460        G
8   75.322823       TE
9   74.894040        C
10  73.965105       DL
11  71.015521       FB
12  71.582575       WR
13  69.649168       RB
14  72.064240        S
15  72.447514        P
16  75.254706       OL
17  70.627081       CB
18  77.134185       OT
19  28.055556        ?
20  72.223058       LS